# //************************************************************
# //             Nucleation + Coagulation
# //************************************************************


import os  # модуль для проверки информации о файлах
import Global_parametrs as gp  # глобальные переменные (Входные данные)
import numpy as np  # подключение библиотеки numpy
from math import sqrt, exp


def Coagulation_Nucleation():
    return print('Coagulation_Nucleation')